{"class_name": "Sequential", "backend": "theano", "keras_version": "2.0.3", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dtype": "float32", "padding": "same", "data_format": "channels_first", "name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 1, 48, 48], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 32, "use_bias": true, "activation": "relu", "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "data_format": "channels_first", "name": "conv2d_2", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 64, "use_bias": true, "activation": "relu", "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_first", "name": "max_pooling2d_1", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "data_format": "channels_first", "name": "conv2d_3", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 64, "use_bias": true, "activation": "relu", "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "name": "dropout_3"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "data_format": "channels_first", "name": "conv2d_4", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 128, "use_bias": true, "activation": "relu", "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_first", "name": "max_pooling2d_2", "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "data_format": "channels_first", "name": "conv2d_5", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 128, "use_bias": true, "activation": "relu", "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.35, "name": "dropout_4"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "data_format": "channels_first", "name": "conv2d_6", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 256, "use_bias": true, "activation": "relu", "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_first", "name": "max_pooling2d_3", "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "data_format": "channels_first", "name": "conv2d_7", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 256, "use_bias": true, "activation": "relu", "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "name": "dropout_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.45, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "trainable": true, "units": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.45, "name": "dropout_7"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "trainable": true, "units": 7, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "softmax", "use_bias": true, "bias_constraint": null}}]}